rrr_nb.tex
% Created 2013-02-13 Wed 10:42
\documentclass[11pt]{article}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{baskervald}
\usepackage[margin=1in]{geometry}
\providecommand{\alert}[1]{\textbf{#1}}

\title{rrr\_nb.org}
\author{}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

\begin{document}

\maketitle

\setcounter{tocdepth}{4}
\tableofcontents
\vspace*{1cm}

\section{About}
\label{sec-1}

This is a ``notebook'' for my work on Really Reproducible Research (RRR). So it's basically a complex scratch pad for working through ideas and assembling materials for the more structured documents that are intended to be shared.
\section{Thinking}
\label{sec-2}
\subsection{Two projects}
\label{sec-2-1}

So there are two sides to this thing.  On one side, the ``theory.''  A conceptual framework for discussing reproducibility, and getting a handle on some goals and ideas for making it work (and what it means for it to work). On the other side, an actual system in order to realize the concepts. 

I'm not sure about the format.  Initially I was thinking of a big book, with Part I being the theory and Part II the implementation, but I'm less sure about that now.  I mean, I think the theory is something that could be written up as a pretty traditional article or short book. Maybe.  Still struggling a little with the structure, but I could imagine it working fine, once I decide on how I want to organize the chapters/sections. 

But I'm starting to re-think Part II. One of the goals needs to be to keep the cost of entry low.  And the problem is that people will come to this with different experiences, different habits, and different needs.  Some linguists may not do any statistical analysis at all.  Some psycholinguists will be interested in starting with the stats stuff, and would benefit if that's all they worked on. Additionally, I'm thinking that for the implementation stuff, I will minimally need three ``pieces'' for each tool/lesson: (1) motivation (\emph{why} is this a good thing?), (2) ``walkthrough'' tutorials (\emph{how} do you do it?), and (3) reference material (for people to refer back to, after completing the walkthroughs).  Putting all that in one monster PDF may not be the best thing, especially if I want to try a more interactive format for the walkthroughs.

However, I do want the ability to link back and forth.  I would like a flow from ``why is X important?'' to ``how do I do X?'' and back again. Maybe just a series of linked PDFs would be good.
\section{Initial workflow ideas}
\label{sec-3}
\subsection{Overview summary}
\label{sec-3-1}

Here's a quick summary of all the components:
\begin{description}
\item[VCS base] Use \texttt{git} or some other VCS to track changes, record commits, etc. The main points are to:
\begin{itemize}
\item encourage a ``literate'' workflow, iterating work and (brief) commenting
\item enable all the powerful \texttt{git} features such as looking back to earlier stages, branching for ``safe'' development, diffs, collaboration, etc.
\item help keep your (virtual) workspaces relatively organized, without explosion of files
\end{itemize}
\item[Notebook] Use \texttt{org-mode} to create a Reproducible Research Notebook (RRNB). The main points are:
\begin{itemize}
\item Simple text format (easy to diff, portable, etc.) with lots of ``fancy'' features if you need them.
\item Can be ``one-stop shopping'' for a research project, combining:
\begin{itemize}
\item lit reviews with bibliographic (BibTeX) info
\item links to papers, websites, other docs, etc.
\item notes and ideas about theory, research questions, etc., with links to other parts of the doc as needed/desired
\item code blocks for \emph{any} language, used for data collection, analysis, etc., which can be used actively (i.e., run within the notebook) or ``passively'' (tangled to an external file to be run).
\item tables, results, raw data, etc. (either links, or in the nifty org-mode table format)
\item complete drafts of papers (either within same doc, or more likely in separate (linked) doc), which can be exported to \LaTeX{}, OpenOffice, etc.
\item TODOs and other functionality for managing a project
\end{itemize}
\item Does not \emph{have} to be the end-all, but minimally useful as a place for notes, with links to other files
\item \textbf{Scales} in complexity as needed, but does not \textbf{require} a complex set-up
\end{itemize}
\item[Lit review] Some processes in the notebook for making a lit review as ``reproducible'' as possible.
\begin{itemize}
\item Reproduce lit searches (when, what terms, what engines?)
\item Reproduce lit commentary (take notes on a paper when reading)
\item Maintain bibliographical info (create \texttt{bibtex} chunks in RRNB, can export at will as needed, never re-type biblio info again!!!). Can use text searching to search in reverse (e.g., find paper called chomsky2001on in PDF form in a project folder or centralized ``research library'' folder, can do text searches for ``chomsky2001on'' through all .org files, etc.)
\end{itemize}
\item[Data collection] 
\begin{itemize}
\item Take notes on data collection
\item Keep notes in central notebook, or linked file
\item Keep code for collecting data in code block or linked file
\item Use table format to keep simple spreadsheet-style notes, like dates of data collection, etc.
\end{itemize}
\item[Data analysis] 
\item[Collaboration] 
\item[Writing papers] 
\end{description}
\subsection{Base}
\label{sec-3-2}
\subsubsection{What?}
\label{sec-3-2-1}

The base of the workflow is ``track and document changes.''  This means using a VCS (version control system/software).  I will use \href{http:git-scm.com}{git}.

The idea here is that at many point along the way in developing any documents or files related to research, changes are tracked, documentation is added, and a history of development is created over time. The VCS can use that history to ``rewind the tape,'' compare versions, and manage collaboration.
\subsubsection{Why?}
\label{sec-3-2-2}
\paragraph{Philosophical}
\label{sec-3-2-2-1}

Research involves revisions. Lots and lots of changes and revisions. Sometimes those revisions are in the ``right'' direction, but sometimes, an earlier version of a document (theory/code/stimuli/etc.) or an ``alternative'' version (if a branching model of development is used) is better.  A good VCS enables movement along this history of revisions and changes in order to facilitate the best possible research.
\paragraph{Ethical}
\label{sec-3-2-2-2}

A good VCS promotes transparency, and may even do a good job of tracking contributions of collaborators, which can help in the distribution of credit (authorship, etc.). But it also improves efficiency when older revisions need to be recovered, and thus can represent signficant savings in time (and money).
