rrr_nb.org
**** Practical
See [[http://jeromyanglim.blogspot.com/2010/11/getting-started-with-git-egit-eclipse.html][this link]] and links therein for some other discussion, as well as [[http://www.kieranhealy.org/files/misc/workflow-apps.pdf][this classic by Kieran Healy]]. I'll paraphrase and expand a little here.
  - You have access to all older revisions without an explosion of (often confusingly-named) files.
  - It's a universal "track changes" mode.
  - With a good VCS, you can easily compare ("diff") versions to see exactly what changed and when.
  - If you back up your VCS in the cloud or some other method, you have /backed-up/ access to all your versions and revisions, which is better than just a single backed-up "final draft."
  - You can "try out" some different analyses or development angles, and switch back or combine them later.
  - You can facilitate collaboration (assuming you get your collaborators to work with the system, or assuming you can manage it for your collaborators).
  - The habit of logging ("committing") changes and documenting them should build more efficient and reproducible work habits.
  - If you maintain your VCS, you can return to the project months or years later, and not have to wonder about where your most up-to-date files are, or where that initial version went.
*** How?
**** Basic principles
     - The system must be "lightweight" -- easy to use, and easy to implement, without interrupting ACTUAL WORK. In other words, if it gets in the way, it's not helpful.
     - The system needs to be robust against "error." If you have to everything *just right*, it's too burdensome. The point is to help guard against error, not screw up all your files and create more work for you.
**** Implementation
     - Use git
       - ONLY work on projects that are git repos.  If you are working on something that's not utterly "disposable," make a git repo (=git init=) and track changes.
       - Any time you *stop* working, you should commit! This is maybe the hardest, since sometimes you get interrupted.  So this is an important habit.  Ideally, committing changes at least once at the end of the day is best.  BUT even if you only commit changes once a week, it's a big improvement on not using a VCS!  So I think in practice, you need to commit changes on a regular-enough schedule that corresponds to "significant additions," which may be defined differently person to person.  Committing after every sentence in a draft is obviously overkill.  Use =git log= and =git status= to check on what has uncommitted changes, and when changes were last committed.
       - Don't proliferate the repo unnecessarily.  I mean, trust the VCS, and use =git branch=, instead of cloning the repo to some other place on your machine and working on it there. This is defeating the point!
       - Make sure you know where the up-to-date repo is.  If you can use [[https://github.com/][GitHub]] (either because you don't mind your work being public, or because you are paying for a private repo), then pushing changes to GitHub is a great way to know exactly where your most up-to-date repo is!  Otherwise, you can use =git log= or =merge= to get things back together.
     - When you can't use git:
       - Act as if you are!
       - When you would normally commit changes, just create a little commit message.
       - When you can get access to git again (hopefully once a day, or nearly so), add the new files/changes, and use the commit message to update the repo.
       - This requires a little more vigilance in creating the messages, though, because it's easier to lose track of changes.  For example, if you forget to comment that you changed file X, you might forget to add it to the git repo until much later.  But if you minimally keep a good record of which files you change/add, it's not that big a deal.

Okay, so taking these points into consideration, here are my working rules:
1. When starting work:
   1. Start git anytime you do ANY work, and if it's not a repo already, use =git init=
   2. Before making new changes, run =git status= and consider committing any uncommitted changes.
   3. If you *can't* use git, start a "COMMIT" file to log changes as you go, keeping track of ALL files that you add/change.
2. Work! (forget about git while you work)
3. When you hit a stopping point, and some significant progress has been made, =git add .= and =git commit=, or just =git commit -a=.  This will pop up an editor to write the commit message.  Or use =git commit -m= plus a message in quote to add a short message.
4. If you are in the middle of something AND you know you will come back to it soon, AND you are not worried about losing what you did, you can put off the commit until later.
5. Make a rule about where the repo should "live."  If not on GitHub, and you use multiple machines, make a rule about which machine should always have the most up-to-date repo.  Collaboration is different. "Self-collaboration" can be confusing.  DON'T make copies of the repo on your own machine (do branching instead).
6. Use =.gitignore= file to simplify commits. Avoid "manual ignore" by leaving a bunch of files untracked but still visible to git.

That's pretty simple, really.

*** Upshot
This is the "base" because:
  - it involves minimal "new stuff".  You work the same as you always do, with whatever programs you want.
  - you're just building an additional habit of logging that work, and committing changes to a VCS.
  - this very simple use of git is easy to learn, and git is easy to install, and cross-plaform.
  - it will insidiously introduce you to the value of simple text, when you get to the point of wanting to diff commits.
  - you can start doing this in an hour or less.
** Notebook
*** What?
The next big step is to dive into the idea of keeping a "reproducible research notebook" (RRNB).  This is the core of the system I'm imagining, because it's a flexible way to start folding more and more activities into a reproducible format.
*** Why?
**** Philosophical
This is all about recording the scientific process, and making it easier and easier for other people to reproduce and replicate your work.  These are big things!  The notebook is what keeps it all in one place.
**** Ethical
Transparency, transparency, transparency!
**** Practical
The idea is one-stop shopping for all of your work.  You put your ideas into it.  You put your literature and comments/notes on papers into it.  You put your code into it.  You might even put your data into it, but you can at least put links to your data into it. You can also manage TODOs (using org-mode) and create a full working environment within the notebook.  How did you run that analysis from 3 papers ago?  Right there in the notebook (or follow a link).  Where did you see the idea for this analysis?  Link to a website/paper/whatever.  Could you share some papers where someone can read about X?  Tangle out the BibTeX info, or export a whole section with all your notes as well. And it's all simple text!
*** How?
[[http://orgmode.org/][Emacs and Org-mode!]]
*** Upshot
* My working system

** Start working
   1. Find (or create) task in .org file (life, or some other agenda file)
   2. Start Pomodoro (25 min.) timer
   3. Clock in (=C-c C-x C-i=)
   4. Start =git= bash, =cd= to project directory
   5. Run =git status= to make sure there are no currently loose threads
