rrr_nb.tex
\paragraph{Practical}
\label{sec-3-2-2-3}

See \href{http://jeromyanglim.blogspot.com/2010/11/getting-started-with-git-egit-eclipse.html}{this link} and links therein for some other discussion, as well as \href{http://www.kieranhealy.org/files/misc/workflow-apps.pdf}{this classic by Kieran Healy}. I'll paraphrase and expand a little here.
\begin{itemize}
\item You have access to all older revisions without an explosion of (often confusingly-named) files.
\item It's a universal ``track changes'' mode.
\item With a good VCS, you can easily compare (``diff'') versions to see exactly what changed and when.
\item If you back up your VCS in the cloud or some other method, you have \emph{backed-up} access to all your versions and revisions, which is better than just a single backed-up ``final draft.''
\item You can ``try out'' some different analyses or development angles, and switch back or combine them later.
\item You can facilitate collaboration (assuming you get your collaborators to work with the system, or assuming you can manage it for your collaborators).
\item The habit of logging (``committing'') changes and documenting them should build more efficient and reproducible work habits.
\item If you maintain your VCS, you can return to the project months or years later, and not have to wonder about where your most up-to-date files are, or where that initial version went.
\end{itemize}
\subsubsection{How?}
\label{sec-3-2-3}
\paragraph{Basic principles}
\label{sec-3-2-3-1}

\begin{itemize}
\item The system must be ``lightweight'' -- easy to use, and easy to implement, without interrupting ACTUAL WORK. In other words, if it gets in the way, it's not helpful.
\item The system needs to be robust against ``error.'' If you have to everything \textbf{just right}, it's too burdensome. The point is to help guard against error, not screw up all your files and create more work for you.
\end{itemize}
\paragraph{Implementation}
\label{sec-3-2-3-2}

\begin{itemize}
\item Use git
\begin{itemize}
\item ONLY work on projects that are git repos.  If you are working on something that's not utterly ``disposable,'' make a git repo (\texttt{git init}) and track changes.
\item Any time you \textbf{stop} working, you should commit! This is maybe the hardest, since sometimes you get interrupted.  So this is an important habit.  Ideally, committing changes at least once at the end of the day is best.  BUT even if you only commit changes once a week, it's a big improvement on not using a VCS!  So I think in practice, you need to commit changes on a regular-enough schedule that corresponds to ``significant additions,'' which may be defined differently person to person.  Committing after every sentence in a draft is obviously overkill.  Use \texttt{git log} and \texttt{git status} to check on what has uncommitted changes, and when changes were last committed.
\item Don't proliferate the repo unnecessarily.  I mean, trust the VCS, and use \texttt{git branch}, instead of cloning the repo to some other place on your machine and working on it there. This is defeating the point!
\item Make sure you know where the up-to-date repo is.  If you can use \href{https://github.com/}{GitHub} (either because you don't mind your work being public, or because you are paying for a private repo), then pushing changes to GitHub is a great way to know exactly where your most up-to-date repo is!  Otherwise, you can use \texttt{git log} or \texttt{merge} to get things back together.
\end{itemize}
\item When you can't use git:
\begin{itemize}
\item Act as if you are!
\item When you would normally commit changes, just create a little commit message.
\item When you can get access to git again (hopefully once a day, or nearly so), add the new files/changes, and use the commit message to update the repo.
\item This requires a little more vigilance in creating the messages, though, because it's easier to lose track of changes.  For example, if you forget to comment that you changed file X, you might forget to add it to the git repo until much later.  But if you minimally keep a good record of which files you change/add, it's not that big a deal.
\end{itemize}
\end{itemize}

Okay, so taking these points into consideration, here are my working rules:
\begin{enumerate}
\item When starting work:
\begin{enumerate}
\item Start git anytime you do ANY work, and if it's not a repo already, use \texttt{git init}
\item Before making new changes, run \texttt{git status} and consider committing any uncommitted changes.
\item If you \textbf{can't} use git, start a ``COMMIT'' file to log changes as you go, keeping track of ALL files that you add/change.
\end{enumerate}
\item Work! (forget about git while you work)
\item When you hit a stopping point, and some significant progress has been made, \texttt{git add .} and \texttt{git commit}, or just \texttt{git commit -a}.  This will pop up an editor to write the commit message.  Or use \texttt{git commit -m} plus a message in quote to add a short message.
\item If you are in the middle of something AND you know you will come back to it soon, AND you are not worried about losing what you did, you can put off the commit until later.
\item Make a rule about where the repo should ``live.''  If not on GitHub, and you use multiple machines, make a rule about which machine should always have the most up-to-date repo.  Collaboration is different. ``Self-collaboration'' can be confusing.  DON'T make copies of the repo on your own machine (do branching instead).
\item Use \texttt{.gitignore} file to simplify commits. Avoid ``manual ignore'' by leaving a bunch of files untracked but still visible to git.
\end{enumerate}

That's pretty simple, really.
\subsubsection{Upshot}
\label{sec-3-2-4}

This is the ``base'' because:
\begin{itemize}
\item it involves minimal ``new stuff''.  You work the same as you always do, with whatever programs you want.
\item you're just building an additional habit of logging that work, and committing changes to a VCS.
\item this very simple use of git is easy to learn, and git is easy to install, and cross-plaform.
\item it will insidiously introduce you to the value of simple text, when you get to the point of wanting to diff commits.
\item you can start doing this in an hour or less.
\end{itemize}
\subsection{Notebook}
\label{sec-3-3}
\subsubsection{What?}
\label{sec-3-3-1}

The next big step is to dive into the idea of keeping a ``reproducible research notebook'' (RRNB).  This is the core of the system I'm imagining, because it's a flexible way to start folding more and more activities into a reproducible format.
\subsubsection{Why?}
\label{sec-3-3-2}
\paragraph{Philosophical}
\label{sec-3-3-2-1}

This is all about recording the scientific process, and making it easier and easier for other people to reproduce and replicate your work.  These are big things!  The notebook is what keeps it all in one place.
\paragraph{Ethical}
\label{sec-3-3-2-2}

Transparency, transparency, transparency!
\paragraph{Practical}
\label{sec-3-3-2-3}

The idea is one-stop shopping for all of your work.  You put your ideas into it.  You put your literature and comments/notes on papers into it.  You put your code into it.  You might even put your data into it, but you can at least put links to your data into it. You can also manage TODOs (using org-mode) and create a full working environment within the notebook.  How did you run that analysis from 3 papers ago?  Right there in the notebook (or follow a link).  Where did you see the idea for this analysis?  Link to a website/paper/whatever.  Could you share some papers where someone can read about X?  Tangle out the BibTeX info, or export a whole section with all your notes as well. And it's all simple text!
\subsubsection{How?}
\label{sec-3-3-3}

\href{http://orgmode.org/}{Emacs and Org-mode!}
\subsubsection{Upshot}
\label{sec-3-3-4}
\section{My working system}
\label{sec-4}
\subsection{Start working}
\label{sec-4-1}

\begin{enumerate}
\item Find (or create) task in .org file (life, or some other agenda file)
\item Start Pomodoro (25 min.) timer
\item Clock in (\texttt{C-c C-x C-i})
\item Start \texttt{git} bash, \texttt{cd} to project directory
\item Run \texttt{git status} to make sure there are no currently loose threads
\end{enumerate}
